<template>
  <main class="min-h-screen flex flex-col items-center justify-center bg-pink-50 text-pink-900">
    <!-- Welcome / Password page -->
    <div v-if="!isUnlocked" class="bg-beige-100 p-8 rounded-2xl shadow-md text-center w-80">
      <h1 class="text-3xl font-bold mb-4">привет жан 😛</h1>
      <p class="mb-4 text-pink-700">пароль пожалуйста 🤗</p>
      <input
        v-model="password"
        @keyup.enter="checkPassword"
        type="password"
        placeholder="dd.mm.yyyy"
        class="border border-rose-300 rounded-md px-3 py-2 mb-4 w-full text-center"
      />
      <button
        @click="checkPassword"
        class="bg-rose-500 hover:bg-rose-600 text-white font-medium px-4 py-2 rounded-md w-full transition"
      >
        Открыть 💌
      </button>
      <p v-if="error" class="text-red-500 mt-3 text-sm">Неправильная дата😤</p>
    </div>

    <!-- Story page -->
    <div v-else class="text-center p-6 animate-fadeIn">
      <h1 class="text-4xl font-bold mb-6">добро пожаловать</h1>
      <p class="mb-4">мой небольшой подарочек🌷</p>

      <section class="w-full mb-4 max-w-5xl mx-auto px-4 py-12 ">

        <button
        @click="toggleMusic"
        class="bg-rose-400 hover:bg-rose-500 text-white px-6 py-3 rounded-full shadow-md transition"
      >
        {{ isPlaying ? 'стоп' : 'для начала музыку' }}
      </button>

      <audio ref="audioRef" loop>
        <source src="/music/love.mp3" type="audio/mpeg" />
      </audio>


        <div class="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-8">
          <div
          v-for="(memory, index) in memories"
          :key="index"
          class="mt-6 bg-white rounded-lg shadow-md border border-rose-200 overflow-hidden transform transition hover:-translate-y-2 hover:shadow-xl"
          >
      <!-- Photo -->
      <img
        v-if="memory.photo"
        :src="memory.photo"
        alt="memory photo"
        class="w-full h-30 object-cover"
      />

      <div class="p-4">
        <!-- Date -->
        <span class="inline-block bg-rose-100 text-rose-700 px-3 py-1 rounded-full text-sm font-medium mb-2">
          {{ memory.date }}
        </span>

        <!-- Text -->
        <p class="text-rose-700 mt-2">{{ memory.text }}</p>
      </div>
    </div>
  </div>
  <div class="mt-12 font-serif text-center text-rose-800 italic text-lg leading-relaxed tracking-wide">
        <p>
          долго думала что писать, не могла подобрать слова и даже скинула азе думая что буду уверена в том что написала.
          в итоге получила лишь разочарование, сомнения в своем же тексте.
          но может и в его словах была правда. 
          не знаю с чего начать, в голове столько всего. начать с моментов что мы пережили или 
          начать с благодарения, может с того как моя жизнь была до 
          тебя и какая она стала после тебя. до тебя не думала что встречу
          кого-то кто будет значить для меня многое, не думала что все 
          произойдет так как произошло при первой встречи. при первой 
          встречи мое внимание было не в игре а скорее в тебе. хотелось 
          узнать какой ты, что ты любишь, какой цвет твой любимый, каких 
          исполнителей ты слушаешь и всё всё всё. но казалось что ты был 
          незаинтересован. но я ошибалась и поняла это с того момента как 
          ты впервые решился со мной поздороваться. с того дня я хотела быть
          ближе к тебе. начала смотреть и искать тебя в чатах,
          в инсте - везде где можно. в итоге судьба свела нас на 
          волейбольной площадке в 1 корпусе. ты был максимально 
          притягательным что я аж пошла тебе покупать литровую воду😛 
          и после пошло поехало - первое сообщение от тебя. и второе 
          сообщение от меня…
          в следующий раз когда мы увиделись, мы уже были в моей 
          комнате. честно, не знала как заговорить ибо на тот момент
          я стеснялась своего казахского а ты своего русского но знаешь
          будто язык не значил ничего возле наших чувств. в тот же день 
          была и наша первая вроде и близкая а вроде и далекая ночь. лежали
          друг против друга - смотря друг другу сияющими глазами. казалось
          что ты читал меня через мои же глаза. на следующий день ты стал
          ближе - намного. хотелось быть ближе и ближе но куда ближе при
          первых дней, да? но сердце говорило что так и надо. да и само 
          тело тянуло к тебе будто знало что ты мой человек. вот и зародилось что то новое, любящие глаза, сердце что стучит без остановок и дыхание что замедляется при виде тебя. 
хочу сказать что с появлением тебя стало намного тише, спокойнее, ярче и стало больше любви в моем сердце. я не думала что встречу любовь всей своей жизни в городе куда случайно поступила, тем более в университете и в общежитии. не думала что университет подарит мне кого то, кого я буду любить, дорожить и ценить. того, с кем мои желания и мечты становятся реальностью. того, кому могу доверить все свои секреты, эмоции и чувства. того,  с кем я буду расти и развиваться. того, кто поддерживает меня, мои начинания и даже мои самые странные мысли. того, кто ставит меня в приоритет при всех обстоятельств. того, кто поймет меня, примет меня и будет любить так как я хочу и так как он хочет и может. 
иногда ловлю себя на мысли что это сон. может и думаю что не достойна такой любви. что я не твой типаж, что я не люблю тебя так как ТЫ хочешь. но ты всегда мне говорил и говоришь как важно любить себя. зная, как ты в каждом разговоре упоминаешь меня как красавицу, милую - у меня не должно быть и сомнении насчет себя. я бы хотела тебе выразить свою благодарность за то что не смотря на все мои подобные мысли, ты всегда находишь выход, говоришь со мной, вытаскиваешь меня с подобной дыры. 
я бесконечно буду счастлива если ты будешь рядом со мной таким какой ты есть. счастливым, улыбчивым, спокойным, добрым, заботливым Мужчиной кому неважно что думают и говорят остальные. не все мужчины заслуживают быть мужчинами с большой буквы, но ты заслуживаешь большее чем Мужчина с большой буквы. ты буквально идеальный. старательный, всегда хочешь достигать чего то и достигаешь, мечтаешь - хочешь и получаешь. ты буквально тот о ком я желала все года начиная с 9 класса. 
в 9 классе у меня была мечта - иметь здоровые, крепкие отношения что перейдет после в семью. я так благодарна тебе, мне, нам за то что спустя такое время мы старательно держимся вместе. проходим все дни, недели, месяцы, этапы - вместе. что у нас есть мы, что у меня есть ты - к кому я могу прибегать после одной пары со словами «жан, моя спина🥹», ты у которого есть я - к которой прибегаешь со словами «жан а что мы будем кушать😛». благодарна нам за то что слушаем, решаем и приходим к ответу и решению. если бы не мы и не наша любовь, мне бы не хватало чего то - моего счастья. 
моему маленькому счастью два года. нашему счастью - два года. желаю чтобы наша любовь стала лишь крепче и прошла все этапы этой жизни. поздравляю нас со второй годовщиной - моя любовь❤️
        </p>
        
        <div class="mt-8 text-center text-sm text-rose-600 italic">
      <p>
        thank you for treating me better from my past. thank you for healing me.
        thank you for trusting me and for giving me your trust. thank you for
        matching my energy and thank you for being the best. i love you so much
      </p>
    </div>
      </div>
</section>

      <footer class="mt-10 text-sm text-rose-700">
        Made with love by Adinka
      </footer>

      <button
      @click="lockAgain"
      class="mt-6 text-sm text-rose-600 underline hover:text-rose-800"
      >
      Закрыть 🔒
      </button>
    </div>
  </main>
</template>

<script setup>
import { ref, onMounted } from 'vue'

// your special date password 💞
const correctPassword = '19.11.2023'

const password = ref('')
const isUnlocked = ref(false)
const error = ref(false)

const checkPassword = () => {
  if (password.value.trim() === correctPassword) {
    isUnlocked.value = true
    error.value = false
    localStorage.setItem('unlocked', 'true') // remember access
  } else {
    error.value = true
  }
}
const isPlaying = ref(false);
const audioRef = ref(null);

function toggleMusic() {
  if (!isPlaying.value) {
    audioRef.value.play();
    isPlaying.value = true;
  } else {
    audioRef.value.pause();
    isPlaying.value = false;
  }
}

const lockAgain = () => {
  localStorage.removeItem('unlocked')
  isUnlocked.value = false
}

// Check if already unlocked before
onMounted(() => {
  const saved = localStorage.getItem('unlocked')
  if (saved === 'true') {
    isUnlocked.value = true
  }
})

const memories = [
  { 
    date: '2023-11-19', 
    text: 'день когда мы начали встречаться', 
    photo: '/images/19.11.png' 
  },
  { 
    date: '2023-12-28', 
    text: 'первый раз вместе в астане', 
    photo: '/images/28.12.png' 
  },
  { 
    date: '2024-01-15', 
    text: 'дни нашей разлуки на каникулы', 
    photo: '/images/15.01.2024.png' 
  },
  { 
    date: '2024-03-08', 
    text: 'восьмое мартааа💞', 
    photo: '/images/08.03.2024.png' 
  },
  { 
    date: '2024-04-16', 
    text: 'наш второй трип в астану', 
    photo: '/images/16.04.2024.png' 
  },
  { 
    date: '2024-04-20', 
    text: 'моя дршкаа', 
    photo: '/images/20.04.2024.png' 
  },
  { 
    date: '2024-04-22', 
    text: 'наши гулянки в астанееее', 
    photo: '/images/22.04.2024.png' 
  },
  { 
    date: '2024-04-26', 
    text: 'твоя дршкаа', 
    photo: '/images/26.04.2024.png' 
  },
  { 
    date: '2024-05-26', 
    text: 'отмечали полгодааа', 
    photo: '/images/26.05.2024.png' 
  },
  { 
    date: '2024-06-04', 
    text: 'страдали фигней во время нашей первой практики', 
    photo: '/images/04.06.2024.png' 
  },
  { 
    date: '2024-06-13', 
    text: 'и опять разлукааа', 
    photo: '/images/13.06.2024.png' 
  },
  { 
    date: '2024-06-18', 
    text: 'уехал', 
    photo: '/images/18.06.2024.png' 
  },
  { 
    date: '2024-06-26', 
    text: 'первые цветочки на расстоянии', 
    photo: '/images/26.06.2024.png' 
  },
  { 
    date: '2024-08-07', 
    text: 'приехаал', 
    photo: '/images/07.08.2024.png' 
  },
  { 
    date: '2024-11-19', 
    text: 'целый год', 
    photo: '/images/19.11.2024.png' 
  },
  { 
    date: '2024-12-08', 
    text: 'любили делать маски', 
    photo: '/images/08.12.2024.png' 
  },
  { 
    date: '2024-12-28', 
    text: 'вот так вот мы и встречали новый год', 
    photo: '/images/28.12.2024.png' 
  },
  { 
    date: '2025-01-30', 
    text: 'начался второй семестр ВТОРОГО курса', 
    photo: '/images/30.01.2025.png' 
  },
  { 
    date: '2025-02-15', 
    text: 'awwww my shaylaaa то как ты мне приносил кофе в постель', 
    photo: '/images/15.02.2025.png' 
  },
  { 
    date: '2025-03-08', 
    text: 'awww восьмое марта уже как второй год', 
    photo: '/images/08.03.2025.png' 
  },
  { 
    date: '2025-04-19', 
    text: 'наш второй концерт и мой самый любимый концерт', 
    photo: '/images/19.04.2025.png' 
  },
  { 
    date: '2025-04-20', 
    text: 'моя дршкааа', 
    photo: '/images/20.04.2025.png' 
  },
  { 
    date: '2025-26-04', 
    text: 'твоя дршкааа', 
    photo: '/images/26.04.2025.png' 
  },
  { 
    date: '2025-09-07', 
    text: 'после долгой разлуки аж на три месяца', 
    photo: '/images/08.09.2025.png' 
  },

];
</script>

<style>
@keyframes fadeIn {
  from {
    opacity: 0;
    transform: translateY(10px);
  }
  to {
    opacity: 1;
    transform: translateY(0);
  }
}

.animate-fadeIn {
  animation: fadeIn 0.8s ease forwards;
}
</style>